Case Data/Diffusion/st_1/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    T
    {
        solver          PBiCGStab;            
        preconditioner  DILU;            
        tolerance       1e-06;          
        relTol          0.1;            
    }
}

SIMPLE
{
    nNonOrthogonalCorrectors 0;         
}

relaxationFactors
{
    fields
    {
        T               1.0;            // No relaxation for explicit scheme
    }
    equations
    {
        T               0.7;            // Relaxation factor for implicit solving
    }
}

// ************************************************************************* //
